In [4]:
import pandas as pd
import numpy as np

students_perfomance = pd.read_csv("StudentsPerformance.csv")

In [ ]:
students_perfomance.head()
students_perfomance.describe()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [18]:
print(students_perfomance.dtypes)
print("-" * 100)
print(students_perfomance.shape)
print(students_perfomance.size)

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object
----------------------------------------------------------------------------------------------------
(1000, 8)
8000

In [27]:
# students_perfomance[0:3, 0:5] error
# students_perfomance.iloc[0:3, 0:5]
students_perfomance.iloc[[0, -1], [0, -1]]

     gender  writing score
0    female             74
999  female             86

In [ ]:
students_perfomance_with_names = students_perfomance.iloc[0:5]
students_perfomance_with_names.index = ["Alex", "John", "Jane", "Jim", "Jill"]
students_perfomance_with_names.loc[["Alex", "John"], ["math score"]]

      math score
Alex          72
John          69

In [47]:
print(type(students_perfomance_with_names['gender']))
print(students_perfomance_with_names['gender'].shape)
students_perfomance_with_names['gender']

<class 'pandas.core.series.Series'>
(5,)

Alex    female
John    female
Jane    female
Jim       male
Jill      male
Name: gender, dtype: object

In [48]:
print(type(students_perfomance_with_names[['gender']]))
print(students_perfomance_with_names[['gender']].shape)
students_perfomance_with_names[['gender']]

<class 'pandas.core.frame.DataFrame'>
(5, 1)

      gender
Alex  female
John  female
Jane  female
Jim     male
Jill    male